Repository: KusayAhmad/Quran-Memorization-Review-App
Catalog: lib/l10n/app_*.arb
Languages: ar

# title
source: Daily Quran Review
ar: الورد اليومي

# homeScreenTitle
source: Daily Quran Review
ar: ورد اليوم

# selectSuras
source: Select Suras for Review
ar: اختر سور ورد اليوم

source: Search Suras
ar: ابحث عن سورة

source: Sort A-Z
ar: رتب من الألف إلى الياء

source: Sort Z-A
ar: رتب من الياء إلى الألف

source: Add
ar: أضف

source: Cancel
ar: إلغاء

source: Update
ar: تحديث

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Save
ar: حفظ

source: Add New Sura
ar: أضف سورة جديدة

source: Sura Name
ar: اسم السورة

source: Number of Pages
ar: عدد الصفحات

source: Congratulations!
ar: تهانينا!

# reviewCompleted
source: You have completed your review for today (＾ᗜ＾) May Allah accept and grant steadfastness
ar: لقد أتممت وردك لهذا اليوم (＾ᗜ＾) تقبل الله منا ومنكم

# alhamdulillah
source: Alhamdullah ♥
ar: الحمد لله ♥

# onePage
source: pages
ar: صفحة

# twoPages
source: pages
ar: صفحتان

source: pages
ar: صفحات

# invalidInput
source: Invalid input provided
ar: مدخلات غير صالحة

# updateProgressFailed
source: Failed to update progress:
ar: فشل في تحديث التقدم:

# clearDataFailed
source: Failed to clear data:
ar: فشل في مسح البيانات:

# suraRemoved
source: Removed
ar: تمت إزالتها

source: Undo
ar: تراجع

# select_at_least_one_sura
source: Please select at least one surah before saving.
ar: يرجى اختيار سورة واحدة على الأقل قبل الحفظ.

# reviewCompletedWithPages
source: You have completed your review for today (＾ᗜ＾). May Allah accept and grant steadfastness Pages reviewed: {pages}
ar: لقد أتممت وردك لهذا اليوم (＾ᗜ＾) تقبل الله منا ومنكم عدد الصفحات التي راجعتها اليوم: {pages}

source: Sort by Last Reviewed
ar: ترتيب حسب آخر مراجعة
